# parameters
nc: 3  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 0.25  # layer channel multiple
# width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, DWConv, [32, 3, 2]],  # 0 320  
   [-1, 1, DWConv, [64, 3, 2]],  # 1 160    
   
   [-1, 1, HorNetBlock, [64]], 
   [-1, 1, ShuffleAttention, [64, 4]], 

   [-1, 1, DWConv, [128, 1, 1]], 
   
   [-1, 1, MP, []],                               # MP-1 start
   [-1, 1, DWConv, [64, 1, 1]],                     # 
   [-3, 1, DWConv, [64, 1, 1]],                     #
   [-1, 1, DWConv, [64, 3, 2]],                     #
   [[-1, -3], 1, Concat, [1]], # outchn = 128 80  # MP-1 end

   [-1, 1, HorNetBlock, [128]], 
   [-1, 1, ShuffleAttention, [128, 8]], # 11

   [-1, 1, DWConv, [256, 1, 1]],  

   [-1, 1, MP, []],                         
   [-1, 1, DWConv, [128, 1, 1]],               
   [-3, 1, DWConv, [128, 1, 1]],              
   [-1, 1, DWConv, [128, 3, 2]],              
   [[-1, -3], 1, Concat, [1]],  # 40x40
   
   [-1, 1, HorNetBlock, [256]], 
   [-1, 1, ShuffleAttention, [256, 8]],  # 19

   [-1, 1, DWConv, [512, 1, 1]], 

   [-1, 1, MP, []],                        
   [-1, 1, DWConv, [256, 1, 1]],              
   [-3, 1, DWConv, [256, 1, 1]],             
   [-1, 1, DWConv, [256, 3, 2]],              
   [[-1, -3], 1, Concat, [1]],  # 20x20

   [-1, 1, HorNetBlock, [512]], 
   [-1, 1, ShuffleAttention, [512, 8]],  #27
  ]

# yolov7-tiny head
head:
  [[-1, 1, DWConv, [256, 1, 1]], # 28
   [-2, 1, DWConv, [256, 1, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, DWConv, [256, 1, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, DWConv, [256, 1, 1]],  # 36
  
   [-1, 1, DWConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [19, 1, DWConv, [128, 1, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]], # 40
   
   [-1, 1, DWConv, [64, 1, 1]],
   [-2, 1, DWConv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, ShuffleAttention, [64, 4]], 
   [[-1, -3, -4, -5], 1, Concat, [1]],
   [-1, 1, DWConv, [128, 1, 1]],  # 47
  
   [-1, 1, DWConv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [11, 1, DWConv, [64, 1, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, DWConv, [32, 1, 1]],
   [-2, 1, DWConv, [32, 1, 1]],
   [-1, 1, DWConv, [32, 3, 1]],
   [-1, 1, DWConv, [32, 3, 1]],
   [-1, 1, ShuffleAttention, [32, 4]], 
   [[-1, -3, -4, -5], 1, Concat, [1]],
   [-1, 1, DWConv, [64, 1, 1]],  # 58
   
   [-1, 1, DWConv, [128, 3, 2]],
   [[-1, 47], 1, Concat, [1]],
   
   [-1, 1, DWConv, [64, 1, 1]],
   [-2, 1, DWConv, [64, 1, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, DWConv, [64, 3, 1]],
   [-1, 1, ShuffleAttention, [64, 4]], 
   [[-1, -3, -4, -5], 1, Concat, [1]],
   [-1, 1, DWConv, [128, 1, 1]],  # 67
   
   [-1, 1, DWConv, [256, 3, 2]],
   [[-1, 36], 1, Concat, [1]],
   
   [-1, 1, DWConv, [128, 1, 1]],
   [-2, 1, DWConv, [128, 1, 1]],
   [-1, 1, DWConv, [128, 3, 1]],
   [-1, 1, DWConv, [128, 3, 1]],
   [-1, 1, ShuffleAttention, [128, 8]], 
   [[-1, -3, -4, -5], 1, Concat, [1]],
   [-1, 1, DWConv, [256, 1, 1]],  # 76
      
   [58, 1, RepConv, [128, 3, 1]],
   [67, 1, RepConv, [256, 3, 1]],
   [76, 1, RepConv, [512, 3, 1]],

   [[77,78,79], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
